#include <iostream>
#include <math.h>
using namespace std;

int main()
{
    //Порядок пріоритетів числових типів: double, float, long, int, short.
    setlocale(LC_ALL, "Ukrainian");
    cout<<"--------Лабораторна робота №3--------"<<endl;
    cout<<"------Робота з типами float та int------"<<endl<<endl;

    cout<<"\n-------------Завдання 1-----------------"<<endl;
    float a=0;
    int b=0;
    cout<<"Введіть ціле число: ";
    cin>>b;
    cout<<"Введіть дійсне число: ";
    cin>>a;

    cout<<"\n-------------Завдання 2-----------------"<<endl;
    int intRes=(a*b)-(a/b);
    float floatRes=(a*b)-(a/b);
    cout<<"Результат обчислень збережений у змінних \nрізного типу.";
    cout<<((intRes==floatRes)? " Результати співпадають!!!" :
                                " Результати не співпадають!")<<endl;

    //Неявне приведення типів
    cout<<"\n-------------Завдання 3-----------------"<<endl;
    int newA=a;
    cout<<"\nНеявне перетворення типів (float в int)\n"<<endl;
    cout<<"\tЗначення до перетворення: "<<a<<endl;
    cout<<"\tЗначення після перетворення: "<<newA<<endl;

    //Явне приведення типів
    cout<<"\n-------------Завдання 4-----------------"<<endl;
    float newB=(float)b;
    cout<<"\nЯвне перетворення типів (int в float)\n"<<endl;
    cout<<"\tЗначення до перетворення: "<<b<<endl;
    cout<<"\tЗначення після перетворення: "<<newB<<endl;

    cout << "\n-----------------Демонстрація -= -----------------" << endl;
    cout << "Старе значення b: " << b << endl;
    b -= 2; // Це означає b = b - 2 (використання оператора -=)
    cout << "Нове значення b: " << b << endl;

    //Операції порівняння
    cout<<"\n-------------Завдання 5-----------------"<<endl;
    bool compare;
    cout<<"\nРезультат порівняння:"<<endl;
    compare=(a==b);
    cout<<"\t(a==b) Результат: "<<compare<<endl;
    compare=(a>=b);
    cout<<"\t(a<=b) Результат: "<<compare<<endl;

// --- Завдання 6: Перевірка обрізання ---
   cout << "\n--- Завдання 6 ---" << endl;
   if (newA == b)
       cout << "Обрізання не відбулося" << endl;
   else
       cout << "Відбулося обрізання даних" << endl;

   // --- Завдання 7: Розмір пам'яті ---
   cout << "\n--- Завдання 7 ---" << endl;
   cout << "int займає " << sizeof(a) << " байт" << endl;
   cout << "float займає " << sizeof(b) << " байт" << endl;

   // --- Завдання 8: Адреси ---
   cout << "\n--- Завдання 8 ---" << endl;
   cout << "Адреса a: " << &a << endl;
   cout << "Адреса b: " << &b << endl;

   return 0;
}

