#include <stdio.h>
#include <iostream>
#include <math.h>

using namespace std;
int main()
{
    //Встановлюємо локацію Україна (дозволяє виводити в консоль кирилицю, окрім букви "і")
    setlocale( LC_ALL,"Ukrainian" );
    cout<<"\n----------------------------------Лабораторна робота №2--------------------------------- \n\n";

    //оголошуємо змінні, які зберігатимуть дані необхідні для обчислення (x,y,z)
    float x,y,z;

    //оголошуємо змінну для збереження результату обчислення
    float f;

    //вводимо значення x, y, z
    cout<<"Введіть значення x,y,z: "<<endl;
    cout<<"tx=";
    cin>>x;
    cout<<"ty=";
    cin>>y;
    cout<<"tz=";
    cin>>z;

    //Обчислюємо математичний вираз ()
    f=(exp(sin(y))+pow(x+y,1./4))/pow(log(z*y),3);

    //Виводимо результат обчислення
    cout<<"\nРезультат обчислення:\n\tf(x,y,z)="<<f<<endl;
    cout<<"- ------------------------------------------------------------------------------------------ \n";
    getchar();
    return 0;
}
